weaver/socialnetwork/evaluation/local/2024-05-02_16:12:38_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 13.946ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 16.008ms, rate sampling interval: 65ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.37ms    8.35ms  45.34ms   86.60%
    Req/Sec    24.16     21.49    92.00     53.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.39ms
 75.000%   17.15ms
 90.000%   27.34ms
 99.000%   45.34ms
 99.900%   57.60ms
 99.990%   73.66ms
 99.999%   73.66ms
100.000%   73.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.647     0.000000            1         1.00
       9.975     0.100000           99         1.11
      10.351     0.200000          198         1.25
      10.631     0.300000          294         1.43
      10.999     0.400000          389         1.67
      11.391     0.500000          487         2.00
      11.695     0.550000          534         2.22
      12.239     0.600000          582         2.50
      13.543     0.650000          631         2.86
      15.127     0.700000          679         3.33
      17.151     0.750000          728         4.00
      18.255     0.775000          752         4.44
      19.423     0.800000          776         5.00
      20.847     0.825000          801         5.71
      22.655     0.850000          826         6.67
      24.639     0.875000          850         8.00
      25.375     0.887500          862         8.89
      27.343     0.900000          873        10.00
      28.943     0.912500          886        11.43
      30.719     0.925000          898        13.33
      32.367     0.937500          910        16.00
      32.927     0.943750          916        17.78
      34.431     0.950000          922        20.00
      35.487     0.956250          929        22.86
      36.767     0.962500          934        26.67
      38.559     0.968750          940        32.00
      39.103     0.971875          943        35.56
      39.743     0.975000          946        40.00
      40.607     0.978125          949        45.71
      40.959     0.981250          952        53.33
      42.271     0.984375          955        64.00
      44.255     0.985938          957        71.11
      44.895     0.987500          958        80.00
      45.343     0.989062          960        91.43
      46.175     0.990625          961       106.67
      47.487     0.992188          963       128.00
      49.759     0.992969          964       142.22
      49.759     0.993750          964       160.00
      50.367     0.994531          965       182.86
      51.327     0.995313          966       213.33
      53.247     0.996094          967       256.00
      53.247     0.996484          967       284.44
      53.247     0.996875          967       320.00
      53.855     0.997266          968       365.71
      53.855     0.997656          968       426.67
      57.599     0.998047          969       512.00
      57.599     0.998242          969       568.89
      57.599     0.998437          969       640.00
      57.599     0.998633          969       731.43
      57.599     0.998828          969       853.33
      73.663     0.999023          970      1024.00
      73.663     1.000000          970          inf
#[Mean    =       15.373, StdDeviation   =        8.346]
#[Max     =       73.600, Total count    =          970]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1506 requests in 30.00s, 621.76KB read
Requests/sec:     50.20
Transfer/sec:     20.72KB
