weaver/socialnetwork/evaluation/local/2024-05-23_19:42:46_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 15.705ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 14.901ms, rate sampling interval: 47ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.35ms    6.62ms  39.33ms   85.14%
    Req/Sec    24.16     21.32    85.00     59.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.80ms
 75.000%   17.31ms
 90.000%   24.78ms
 99.000%   39.33ms
 99.900%   49.92ms
 99.990%   52.10ms
 99.999%   52.10ms
100.000%   52.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.927     0.000000            1         1.00
      10.167     0.100000           97         1.11
      10.679     0.200000          194         1.25
      11.255     0.300000          292         1.43
      11.911     0.400000          388         1.67
      12.799     0.500000          485         2.00
      13.367     0.550000          533         2.22
      13.983     0.600000          583         2.50
      14.655     0.650000          630         2.86
      15.639     0.700000          679         3.33
      17.311     0.750000          727         4.00
      18.175     0.775000          751         4.44
      19.007     0.800000          776         5.00
      20.431     0.825000          800         5.71
      21.903     0.850000          824         6.67
      23.247     0.875000          848         8.00
      24.047     0.887500          860         8.89
      24.975     0.900000          873        10.00
      25.887     0.912500          886        11.43
      26.911     0.925000          898        13.33
      27.983     0.937500          909        16.00
      28.607     0.943750          915        17.78
      29.391     0.950000          921        20.00
      30.079     0.956250          927        22.86
      31.119     0.962500          933        26.67
      31.839     0.968750          939        32.00
      33.215     0.971875          942        35.56
      33.471     0.975000          945        40.00
      34.431     0.978125          948        45.71
      35.999     0.981250          951        53.33
      36.703     0.984375          954        64.00
      38.271     0.985938          956        71.11
      38.431     0.987500          957        80.00
      39.327     0.989062          959        91.43
      40.255     0.990625          960       106.67
      41.151     0.992188          962       128.00
      42.239     0.992969          963       142.22
      42.239     0.993750          963       160.00
      43.295     0.994531          964       182.86
      43.871     0.995313          965       213.33
      44.959     0.996094          966       256.00
      44.959     0.996484          966       284.44
      44.959     0.996875          966       320.00
      45.535     0.997266          967       365.71
      45.535     0.997656          967       426.67
      49.919     0.998047          968       512.00
      49.919     0.998242          968       568.89
      49.919     0.998437          968       640.00
      49.919     0.998633          968       731.43
      49.919     0.998828          968       853.33
      52.095     0.999023          969      1024.00
      52.095     1.000000          969          inf
#[Mean    =       15.355, StdDeviation   =        6.624]
#[Max     =       52.064, Total count    =          969]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1506 requests in 30.00s, 727.67KB read
Requests/sec:     50.19
Transfer/sec:     24.25KB
